tests/resources/swagger/auth-basic-converted.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: BZM-API
scenarios:
  BZM-API:
    default-address: https://a.blazemeter.com
    headers:
      Authorization: Basic ${__base64Encode(${auth})}
    requests:
    - url: ${basePath}/tests
settings:
  env:
    auth: USER:PASSWORD
    basePath: /api/v4