tests/resources/swagger/auth-key-multiscenarios-converted.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: /tests
scenarios:
  /tests:
    default-address: ${defaultAddress}
    headers:
      api_key: ${myApiKey}
    requests:
    - url: ${basePath}/tests
settings:
  env:
    basePath: /api/v4
    defaultAddress: https://a.blazemeter.com
    myApiKey: TOKEN