tests/resources/swagger/bzm-converted-none.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: BZM-API
scenarios:
  BZM-API:
    default-address: https://a.blazemeter.com
    requests:
    - url: ${basePath}/tests
    - method: POST
      url: ${basePath}/tests
    - url: ${basePath}/tests/{testId}
    - method: PUT
      url: ${basePath}/tests/{testId}
    - method: DELETE
      url: ${basePath}/tests/{testId}
    - method: PATCH
      url: ${basePath}/tests/{testId}
    - method: POST
      url: ${basePath}/tests/{testId}/start
    - url: ${basePath}/reports
    - url: ${basePath}/reports/{reportId}
settings:
  env:
    basePath: /api/v4