tests/resources/swagger/bzm-converted-variables.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: BZM-API
scenarios:
  BZM-API:
    default-address: https://a.blazemeter.com
    requests:
    - url: /api/v4/tests
    - body: ${body}
      method: POST
      url: /api/v4/tests
    - url: /api/v4/tests/${testId}
    - body: ${body}
      method: PUT
      url: /api/v4/tests/${testId}
    - method: DELETE
      url: /api/v4/tests/${testId}
    - body: ${body}
      method: PATCH
      url: /api/v4/tests/${testId}
    - method: POST
      url: /api/v4/tests/${testId}/start
    - url: /api/v4/reports
    - url: /api/v4/reports/${reportId}