tests/resources/swagger/petstore-converted.yaml
---
execution:
- concurrency: 1
  hold-for: 1m
  scenario: Swagger-Petstore
scenarios:
  Swagger-Petstore:
    default-address: ${default-address}
    requests:
    - label: updatePet
      method: PUT
      url: ${default-path}/pet
    - label: addPet
      method: POST
      url: ${default-path}/pet
    - label: findPetsByStatus
      url: ${default-path}/pet/findByStatus?status=%5B1%2C+2%2C+3%5D
    - label: findPetsByTags
      url: ${default-path}/pet/findByTags?tags=%5B1%2C+2%2C+3%5D
    - label: getPetById
      url: ${default-path}/pet/1
    - label: updatePetWithForm
      method: POST
      url: ${default-path}/pet/1
    - label: deletePet
      method: DELETE
      url: ${default-path}/pet/1
    - label: uploadFile
      method: POST
      url: ${default-path}/pet/1/uploadImage
    - label: getInventory
      url: ${default-path}/store/inventory
    - label: placeOrder
      method: POST
      url: ${default-path}/store/order
    - label: getOrderById
      url: ${default-path}/store/order/1
    - label: deleteOrder
      method: DELETE
      url: ${default-path}/store/order/1
    - label: createUser
      method: POST
      url: ${default-path}/user
    - label: createUsersWithArrayInput
      method: POST
      url: ${default-path}/user/createWithArray
    - label: createUsersWithListInput
      method: POST
      url: ${default-path}/user/createWithList
    - label: loginUser
      url: ${default-path}/user/login?username=some_string
    - label: logoutUser
      url: ${default-path}/user/logout
    - label: getUserByName
      url: ${default-path}/user/some_string
    - label: updateUser
      method: PUT
      url: ${default-path}/user/some_string
    - label: deleteUser
      method: DELETE
      url: ${default-path}/user/some_string
settings:
  env:
    default-address: http://petstore.swagger.io
    default-path: /v2